<?php

$bodys = " БЛЕАТЬ ХУЙ ПИЗДА ГОВНО МУДИЛО ХУЙЛО ЕБЛО ГГОГОГ ОЛОЛОЛ ТРОЛОЛОЛО
ЕБАНАШКАХУЙ ПИЗДА ГОВНО МУДИЛО ХУЙЛО ЕБЛО ГГОГОГ ОЛОЛОЛ ТРОЛОЛОЛО
ЕБАНАШКАХУЙ ПИЗДА ГОВНО МУДИЛО ХУЙЛО ЕБЛО ГГОГОГ ОЛОЛОЛ ТРОЛОЛОЛО
ЕБАНАШКАХУЙ ПИЗДА ГОВНО МУДИЛО ХУЙЛО ЕБЛО ГГОГОГ ОЛОЛОЛ ТРОЛОЛОЛО
ЕБАНАШКАХУЙ ПИЗДА ГОВНО МУДИЛО ХУЙЛО ЕБЛО ГГОГОГ ОЛОЛОЛ ТРОЛОЛОЛО
ЕБАНАШКА";
$matwords = array ("ХУЙ", "ПИЗДА", "ЕБЛО");
$scenwords = array ("Х*й", "П**да", "Е***ло");

$newbody = str_replace($matwords, $scenwords, $_POST["replacetext"], $howmany);

$err_message = '';
if (empty($newbody)) {

    echo "Ты че долбоеб?";
}

else {

    echo "Привет, " . $newbody;

    echo "</br></br>";

    echo "Количество цунзур: " . $howmany;
}

            ?>